CSI API ETABS v1
cPointObj.CountLoadForce Method
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int CountLoadForce(
	ref int Count,
	string Name = "",
	string LoadPat = ""
)
Function CountLoadForce (
	ByRef Count As Integer,
	Optional Name As String = "",
	Optional LoadPat As String = ""
) As Integer
Dim instance As cPointObj
Dim Count As Integer
Dim Name As String
Dim LoadPat As String
Dim returnValue As Integer
returnValue = instance.CountLoadForce(Count,
	Name, LoadPat)
int CountLoadForce(
	int% Count,
	String^ Name = L"",
	String^ LoadPat = L""
)
abstract CountLoadForce :
        Count : int byref *
        ?Name : string *
        ?LoadPat : string
(* Defaults:
        let _Name = defaultArg Name ""
        let _LoadPat = defaultArg LoadPat ""
*)
-> int
Parameters
Count
Type: System.Int32
Name (Optional)
Type: System.String
LoadPat (Optional)
Type: System.String
Return Value
Type: Int32
See Also
Reference
cPointObj Interface
ETABSv1 Namespace